In [1]:
import pandas as pd

In [6]:
products = [
    {'Name':'คีย์บอร์ด','Category':'อุปกรณ์คอม','Price':1200},
    {'Name':'ตุ๊กตา','Category':'ของเล่น','Price':900},
    {'Name':'Iphone12','Category':'มือถือ','Price':35000},
    {'Name':'ทุเรียน','Category':'ผลไม้','Price':600}
]

In [8]:
df = pd.DataFrame(products)

In [9]:
df

        Name    Category  Price
0  คีย์บอร์ด  อุปกรณ์คอม   1200
1     ตุ๊กตา     ของเล่น    900
2   Iphone12      มือถือ  35000
3    ทุเรียน       ผลไม้    600

In [11]:
df.set_index(["Name"],inplace=True)

In [12]:
df

             Category  Price
Name
คีย์บอร์ด  อุปกรณ์คอม   1200
ตุ๊กตา        ของเล่น    900
Iphone12       มือถือ  35000
ทุเรียน         ผลไม้    600